import React, { Component } from 'react';
import Navigacija from "./Navigation";
import logo from './logo.png';
import ck from './crvenKrst.png';
import ds from './detskoSelo.png';
import h from './humanost.png';
//import search from '../otherComponents/search.png';
import 'bootstrap/dist/css/bootstrap.min.css';
import 'bootstrap/dist/css/bootstrap-theme.css';
import 'C:/Users/Freeware Sys/react-lab/src/fonts/css/font-awesome.min.css';
import Footer from "./Footer";
//import Card from './Card';
//import data from '../otherComponents/data/
import Pagination from "./MakingStory";


class Org extends Component {

    render(){
        let links =[
            {label: 'Дома', link:"/home"},
            {label: 'Организации', link:"/organizations", active: true},
            {label: 'Животни приказни', link:"/stories"},
            {label: 'За нас', link:"/forUs"},
            {label: 'Најави се', link:"/login"},
            {label: 'Регистрирај се', link:"/register"},
        ];

        return (

            <div className="container">
                <Navigacija links={links} logo={logo}/>
                <div className="tables">
                  <table className="table table-striped">
                      <tbody>
                      <tr>
                          <td className="slika"><img src={ck}/></td>
                          <td><h2 className="naslovi">Црвен крст на Република Македонија</h2><br/><p>Црвен крст на Република Македонија е хуманитарна организација која работи на спречување и ублажување на човековото страдање, заштита на животот и здравјето, унапредување на социјалната состојба, обезбедувајќи почит и достоинство за човековото битие, а особено во случај на несреќи и катастрофи,  го промовира меѓународното хуманитарно право и хуманите вредности, поттикнува доброволно ангажирање и постојана подготвеност за давање помош, како и универзално чувство за солидарност и хуманост.</p><br/><p className="vizija">Визија:

                              Дејствуваме, поттикнуваме и промовираме хумани вредности за навремено да одговориме на современите хуманитарни предизвици, а притоа решени сме да направиме повеќе, да го направиме тоа подобро и да стигнеме подалеку.</p><br/><p>За оваа невладина огранизација можете да видите повеќе на следниот линк: <a href="www.ckrm.org.mk">www.ckrm.org.mk</a></p></td>

                      </tr>
                      <tr>

                          <td><h2 className="naslovi">СОС Детско село Македонија</h2><br/><p>СОС Детски села Интернационал е меѓународна невладина организација за социјална заштита, посветена на заштита и примена на детските права уште од 1949 година кога првото СОС Детско село било основано од Херман Гмајнер во Имст, Австрија.

                              Речиси 70 години работиме на заштита и грижа за децата кои ја загубиле, или се изложени на ризик да ја загубат родителската грижа. Работиме со заедниците, партнерите и државите за да се осигураме дека се исполнети правата на сите деца во секое општество.</p><br/><p className="vizija">Со поддршка од многу донатори и соработници, организацијата бргу се распространува и помага на децата од целиот свет. Во 135 земји и територии, активностите на меѓународната организација СОС Детски села се фокусираат на поддршка на децата без родители и родителска грижа и децата кои се во ризик да ја загубат грижата од своите семејства.

                              СОС Детски села ставаат главен фокус на семејно заснованата, долгорочна грижа на децата кои ја загубиле можноста да растат во своите биолошки семејства. Во СОС Детските села и програмите за грижа за млади, тие повторно наоѓаат сигурност, љубов, и топол дом. Растат во стабилна семејна средина и добиваат континуирана индивидуална поддршка се додека станат независни млади личности.</p></td>
                          <td className="slika1"><img src={ds}/><br/><br/><br/><p>СОС Детски села ги почитуваат различните култури и религии работејќи во земји и заедници каде што мисијата на организацијата може да придонесе кон нивниот развој. Работата на СОС Детски села е во духот на Конвенцијата за правата на детето на ООН, која се промовира низ целиот свет.
                          </p><br/><p>За оваа невладина огранизација можете да видите повеќе на следниот линк: <a href="www.sos.org.mk">www.sos.org.mk</a></p></td>
                      </tr>
                      <tr>
                          <td className="slika"><img src={h}/></td>
                          <td><h2 className="naslovi">Хуманост</h2><br/><p>Постоењето на Здружение ХУМАНОСТ е иницирано од група граѓани, сегашни членови на Здружението, врз основа на идентичноста на нивните уверувања и хуманитарни погледи во однос на постоењето на потребата за  лицата кои се изложени на ризик од осиромашување и општествено исклучување да ги добијат потребните можности и ресурси за целосно учество во економскиот, општествениот и културниот живот и за уживање на стандардните услови за живеење и социјална сигурност кои се сметаат за нормални во општеството во кое живеат. Ние ќе им овозможи нивно поголемо учество во процесот на донесување на одлуки кои влијаат врз нивниот живот и пристапот до фундаменталните права.</p><br/><p className="vizija">Визија:

                              Поголема социјална интеграција  на лицата во социјален ризик.</p><br/><p>За оваа невладина огранизација можете да видите повеќе на следниот линк: <a href="www.humanost.org.mk">www.humanost.org.mk</a></p></td>

                      </tr>
                      </tbody>

                  </table>
                </div>
                <nav className="pag">
                    <ul className="pagination">
                        <li className="page-item disabled">
                            <a className="page-link" href="#" tabIndex="-1">Previous</a>
                        </li>
                        <li className="page-item active"><a className="page-link" href="http://localhost:3000/organizations">1</a></li>
                        <li className="page-item ">
                            <a className="page-link" href="http://localhost:3000/organizations2">2 <span className="sr-only">(current)</span></a>
                        </li>
                        <li className="page-item"><a className="page-link" href="#">3</a></li>
                        <li className="page-item">
                            <a className="page-link" href="#">Next</a>
                        </li>
                    </ul>
                </nav>

                <Footer/>
            </div>



        );
    }

}
export default Org;
